---
kind: type
id: T:Autodesk.Revit.DB.Electrical.ConduitRun
source: html/99616074-134d-af15-8e79-7a8fb448a2ab.htm
---
# Autodesk.Revit.DB.Electrical.ConduitRun

This class represents a conduit run in Autodesk Revit.

## Syntax (C#)
```csharp
public class ConduitRun : CableTrayConduitRunBase
```

## Remarks
This class is mainly for calculating length of a conduit run.
 A conduit run contains connected straight conduit segments and bends between the straight segments with same type and size.